testXMLOject.xml

<?xml version="1.0" encoding="UTF-8"?>
<WL5G3N0:definitions name="HudsonDemo" targetNamespace="http://archenroot.org/HudsonDemo/" xmlns:WL5G3N0="http://schemas.xmlsoap.org/wsdl/" xmlns:WL5G3N1="http://www.example.org/SendJMS" xmlns:WL5G3N2="http://archenroot.org/HudsonDemo/" xmlns:WL5G3N3="http://schemas.xmlsoap.org/wsdl/soap/">
  <WL5G3N0:types>
    <xsd:schema targetNamespace="http://archenroot.org/HudsonDemo/" xmlns:send="http://www.example.org/SendJMS" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://archenroot.org/HudsonDemo/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <xsd:import namespace="http://www.example.org/SendJMS" schemaLocation="http://prometheus:11001/HudsonDemo/proxy/SendJMSQueue?SCHEMA%2FHudsonDemo%2Fschema%2FSendJMS"/>
    </xsd:schema>
  </WL5G3N0:types>
  <WL5G3N0:message name="sendJMSMessageRequest">
    <WL5G3N0:part element="WL5G3N1:sendJMSMessage" name="parameters"/>
  </WL5G3N0:message>
  <WL5G3N0:message name="sendJMSMessageResponse">
    <WL5G3N0:part element="WL5G3N1:sendJMSMessageResponse" name="parameters"/>
  </WL5G3N0:message>
  <WL5G3N0:portType name="JMSTest">
    <WL5G3N0:operation name="sendJMSMessage">
      <WL5G3N0:input message="WL5G3N2:sendJMSMessageRequest"/>
      <WL5G3N0:output message="WL5G3N2:sendJMSMessageResponse"/>
    </WL5G3N0:operation>
  </WL5G3N0:portType>
  <WL5G3N0:binding name="HudsonDemoSOAP" type="WL5G3N2:JMSTest">
    <WL5G3N3:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <WL5G3N0:operation name="sendJMSMessage">
      <WL5G3N3:operation soapAction="http://archenroot.org/HudsonDemo/sendJMSMessage"/>
      <WL5G3N0:input>
        <WL5G3N3:body use="literal"/>
      </WL5G3N0:input>
      <WL5G3N0:output>
        <WL5G3N3:body use="literal"/>
      </WL5G3N0:output>
    </WL5G3N0:operation>
  </WL5G3N0:binding>
  <WL5G3N0:service name="HudsonDemoSOAPQSService">
    <WL5G3N0:port binding="WL5G3N2:HudsonDemoSOAP" name="HudsonDemoSOAPQSPort">
      <WL5G3N3:address location="http://prometheus:11001/HudsonDemo/proxy/SendJMSQueue"/>
    </WL5G3N0:port>
  </WL5G3N0:service>
</WL5G3N0:definitions>